




// Урок 2 

// Задание 1

var a=1, b=1, c, d;
c = ++a; alert(c);           //2  так как префиксная форма (++a), то сначала значение переменной увеличивается на 1(происходит инкрементирование) а потом возврат с обновленным значением
d = b++; alert(d)            //1  так как постфиксная форма (а++), то сначала происходит возвращение значения, а потом выполняется инкрементирование.
c = (2+ ++a); alert(c);      //5  так как в предыдущих строках кода значение переменной уже было увеличено на 1. В жтой строке мы видим сумму 2+3
d = (2+ b++); alert(d);      //4  так как в предыдущих строках кода значение переменной уже было увеличено. В этой строке мы видим сумму 2+2
alert(a);                    //3  так как в предыдущих строках кода значение переменной уже было увеличено. Поэтому в этой строке мы видим 3
alert(b);                    //3  так как в предыдущих строках кода значение переменной уже было увеличено. Но также здесь у b постфиксная форма. Поэтому в этой строке мы видим 3








// задание 2

let a = 2;
let x = 1+(a *=2);

// В этом примере x будет равен 5  
/* Я так поняла что  выражение в скобках (a *=2) равнозначно выражению a*2, а *=  это комбинированный оператор.
следовательно  x=1+(2*2); */ 





//Задание 3


var a=23;
var b=10;
if ((a>=0) && (b>=0)) 
 alert(a-b);
else if ((a<0) && (b<0)) 
 alert(a*b);
else if ((a<0) && (b>0)) 
 alert(a+b);
else if ((a>0) && (b<0)) 
 alert(a+b);



//Задание ###4


var a=10;
switch(a){
    case 10:
        alert("10")
        alert("11")
        alert("12")
        alert("13")
        alert("14")
        alert("15")
        break;
}

//или так:


var a=10;
switch(a){
    case 10:
alert("10,11,12,13,14,15")
        break;
}


// Задание ###5
/* В этом задании консоль выдает вот такую ошибку:Uncaught ReferenceError: a is not defined  Ничего не удалось с этим сделать, непонятно почему a не определена*///

function mathOperations (a, b) {
    return (a+b);
}
mathOperations (24, 6);
alert (a+b);


function mathOperations (a, b) {
    return (a-b);
}
mathOperations (24, 6);
alert (a-b);


function mathOperations (a, b) {
    return (a*b);
}
mathOperations (24, 6);
alert (a*b);


function mathOperations (a, b) {
    return (a/b);
}
mathOperations (24, 6);
  alert (a/b);



//Задание ### 7

//null будет равен 0

function compeare (x, y) {
    if (x > y)
        alert("null>0");
    else if (x<y)
        alert("null<0");
    else (x = y)
    alert("x=y");
}
compeare(null, 0);

































